### 1. 라이브러리 선언

In [17]:
import pandas as pd
import numpy as np

### 2. 데이터 불러오기

In [18]:
targetData = \
        pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

#### REGIONID : STR : 지역 정보 : 1 : 20 : 미국, 영국 등 법인 정보
#### PRODUCT : STR : 상품 정보 : 1 : 20 : TV, 냉장고 등
#### YEARWEEK : INT : 연주차 정보 : 1 : 6
#### QTY : FLOAT : 판매량 SELLOUT : 음수로 된 반품값 존재

In [19]:
### describe - 숫자형 데이터에 대한 기본 통계를 만들어준다.

In [20]:
targetData.describe()

           YEARWEEK           QTY
count  124658.00000  1.246580e+05
mean   201526.66879  8.949287e+03
std        82.77994  4.294973e+04
min    201401.00000 -3.640000e+02
25%    201440.00000  3.200000e+01
50%    201527.00000  2.820000e+02
75%    201613.00000  2.223000e+03
max    201652.00000  1.663206e+06

In [21]:
### 데이터 형태 변환

In [22]:
selloutData = targetData.astype ({ "REGIONID":str,
                                    "PRODUCT":str,
                                    "YEARWEEK":str,
                                    "QTY":float })

In [23]:
selloutData

       REGIONID    PRODUCT YEARWEEK      QTY
0           A60   PRODUCT4   201402     71.0
1           A60  PRODUCT59   201402  22275.0
2           A60  PRODUCT34   201402   4463.0
3           A60  PRODUCT47   201402      0.0
4           A60  PRODUCT56   201402     23.0
...         ...        ...      ...      ...
124653      A10  PRODUCT60   201630    824.0
124654      A10  PRODUCT56   201630    275.0
124655      A10  PRODUCT61   201630      0.0
124656      A10  PRODUCT12   201630  15021.0
124657      A10   PRODUCT1   201630    568.0

[124658 rows x 4 columns]

### [불량 데이터 처리] qty가 음수인경우 0, 양수인 경우 기존 qty값 유지

In [27]:
selloutData["QTY_NEW"] = np.where ( selloutData.QTY < 0, 0, selloutData.QTY)

In [40]:
## 검증로직
#selloutData.loc[selloutData.QTY_NEW < 0]
selloutData[selloutData.QTY < 0]["QTY"].count()

323

### [데이터 통합 실습문제] year, week 컬럼을 생성하고, week가 52이하인 데이터만 조회한 후 refinedSelloutData 변수에 담아라

#### 1. year, week 분리하자

In [30]:
selloutData["YEAR"] = selloutData.YEARWEEK.str[0:4]

In [31]:
selloutData["WEEK"] = selloutData.YEARWEEK.str[4:6]

#### 2. int로 바꿔주기.

In [32]:
newSelloutData = selloutData.astype ({ "REGIONID":str,
                                    "PRODUCT":str,
                                    "YEARWEEK":str,
                                    "QTY":float,
                                    "YEAR":int,
                                    "WEEK":int})

#### 3. 데이터 추출

In [33]:
refinedSelloutData = newSelloutData.loc[newSelloutData.WEEK <= 52]

#### 4. 검증로직

In [38]:
refinedSelloutData.loc[refinedSelloutData.WEEK >= 53]

Empty DataFrame
Columns: [REGIONID, PRODUCT, YEARWEEK, QTY, QTY_NEW, YEAR, WEEK]
Index: []

In [35]:
refinedSelloutData

       REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR  WEEK
0           A60   PRODUCT4   201402     71.0     71.0  2014     2
1           A60  PRODUCT59   201402  22275.0  22275.0  2014     2
2           A60  PRODUCT34   201402   4463.0   4463.0  2014     2
3           A60  PRODUCT47   201402      0.0      0.0  2014     2
4           A60  PRODUCT56   201402     23.0     23.0  2014     2
...         ...        ...      ...      ...      ...   ...   ...
124653      A10  PRODUCT60   201630    824.0    824.0  2016    30
124654      A10  PRODUCT56   201630    275.0    275.0  2016    30
124655      A10  PRODUCT61   201630      0.0      0.0  2016    30
124656      A10  PRODUCT12   201630  15021.0  15021.0  2016    30
124657      A10   PRODUCT1   201630    568.0    568.0  2016    30

[123864 rows x 7 columns]